Revit 2026 API

# StructuralAssetMetalResistanceCalculationStrength Property

---

The resistance calculation strength of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double MetalResistanceCalculationStrength { get; set; }
```
```vb
Public Property MetalResistanceCalculationStrength As Double
	Get
	Set
```
```cpp
public:
property double MetalResistanceCalculationStrength {
	double get ();
	void set (double value);
}
```
```fsharp
member MetalResistanceCalculationStrength : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InapplicableDataException | When setting this property: the material type must be Metal to set this property. |

Applies to metal-based structural assets.

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace